## 파일불러오기 & 합치기

In [1]:
import pandas as pd
import numpy as np
from pandas import Series, DataFrame
import csv 
import matplotlib.pyplot as plt

In [2]:
data_2019_01 = pd.read_csv('./data/H_data/T20_2019_1백만.1.csv', encoding='cp949')
data_2019_02 = pd.read_csv('./data/H_data/T20_2019_1백만.2.csv', encoding='cp949')
data_2019_03 = pd.read_csv('./data/H_data/T20_2019_1백만.3.csv', encoding='cp949')

In [3]:
data_2020_01 = pd.read_csv('./data/H_data/HP_T20_2020_1.CSV', encoding='cp949')
data_2020_02 = pd.read_csv('./data/H_data/HP_T20_2020_2.CSV', encoding='cp949')
data_2020_03 = pd.read_csv('./data/H_data/HP_T20_2020_3.CSV', encoding='cp949')

In [4]:
data = pd.concat([data_2019_01, data_2019_02, data_2019_03, data_2020_01, data_2020_02, data_2020_03])

In [5]:
data.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 24905593 entries, 0 to 3905194
Data columns (total 19 columns):
 #   Column      Dtype
---  ------      -----
 0   기준년도        int64
 1   가입자 일련번호    int64
 2   진료내역일련번호    int64
 3   성별코드        int64
 4   연령대코드       int64
 5   시도코드        int64
 6   요양개시일자      object
 7   서식코드        int64
 8   진료과목코드      int64
 9   주상병코드       object
 10  부상병코드       object
 11  요양일수        int64
 12  입내원일수       int64
 13  심결가산율       float64
 14  심결요양급여비용총액  int64
 15  심결본인부담금     int64
 16  심결보험자부담금    int64
 17  총처방일수       int64
 18  데이터 기준일자    object
dtypes: float64(1), int64(14), object(4)
memory usage: 3.7+ GB

In [8]:
data_2019 = pd.concat([data_2019_01, data_2019_02, data_2019_03])

In [5]:
data_2020 = pd.concat([data_2020_01, data_2020_02, data_2020_03])

In [6]:
data_2019.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 13178345 entries, 0 to 3951426
Data columns (total 19 columns):
 #   Column      Dtype
---  ------      -----
 0   기준년도        int64
 1   가입자 일련번호    int64
 2   진료내역일련번호    int64
 3   성별코드        int64
 4   연령대코드       int64
 5   시도코드        int64
 6   요양개시일자      int64
 7   서식코드        int64
 8   진료과목코드      int64
 9   주상병코드       object
 10  부상병코드       object
 11  요양일수        int64
 12  입내원일수       int64
 13  심결가산율       float64
 14  심결요양급여비용총액  int64
 15  심결본인부담금     int64
 16  심결보험자부담금    int64
 17  총처방일수       int64
 18  데이터 기준일자    int64
dtypes: float64(1), int64(16), object(2)
memory usage: 2.0+ GB

In [7]:
data_2020.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 11727248 entries, 0 to 3905194
Data columns (total 19 columns):
 #   Column      Dtype
---  ------      -----
 0   기준년도        int64
 1   가입자 일련번호    int64
 2   진료내역일련번호    int64
 3   성별코드        int64
 4   연령대코드       int64
 5   시도코드        int64
 6   요양개시일자      object
 7   서식코드        int64
 8   진료과목코드      int64
 9   주상병코드       object
 10  부상병코드       object
 11  요양일수        int64
 12  입내원일수       int64
 13  심결가산율       float64
 14  심결요양급여비용총액  int64
 15  심결본인부담금     int64
 16  심결보험자부담금    int64
 17  총처방일수       int64
 18  데이터 기준일자    object
dtypes: float64(1), int64(14), object(4)
memory usage: 1.7+ GB

## 원하는 컬럼만 추출하기

In [9]:
data_2019_df = data_2019.loc[:,['성별코드', '연령대코드', '시도코드', '진료과목코드', '주상병코드', '부상병코드']]
data_2019_df.head()

   성별코드  연령대코드  시도코드  진료과목코드  주상병코드  부상병코드
0     2     12    46       5   M751   M750
1     2     12    46       1  E1164   N308
2     2     12    46       1   N308  E1164
3     2     12    46       1  E1164   N308
4     2     12    46      13  H6531   J303

In [10]:
data_2020_df = data_2020.loc[:,['성별코드', '연령대코드', '시도코드', '진료과목코드', '주상병코드', '부상병코드']]
data_2020_df.head()

   성별코드  연령대코드  시도코드  진료과목코드 주상병코드 부상병코드
0     1     17    41       1  I109  E785
1     1     17    41       1  I109  E785
2     2     18    41       1  I109  I251
3     2     18    41       1  I109  I251
4     2     17    41       1  I109  E780

In [6]:
data_df = data.loc[:,['성별코드', '연령대코드', '시도코드', '진료과목코드', '주상병코드']]
data_df.head()

   성별코드  연령대코드  시도코드  진료과목코드  주상병코드
0     2     12    46       5   M751
1     2     12    46       1  E1164
2     2     12    46       1   N308
3     2     12    46       1  E1164
4     2     12    46      13  H6531

In [21]:
# drop() 으로 원하는 컬럼만 추출하기
# data_df = data.drop(['기준년도','가입자 일련번호', '진료내역일련번호', '요양개시일자', '서식코드', '요양일수', '입내원일수', '심결가산율', '심결요양급여비용총액', '심결본인부담금', '심결보험자부담금', '총처방일수', '데이터 기준일자'], axis=1)
# data_df.head()

## 원하는 컬럼으로 정렬하기

In [10]:
data19 = data_2019_df.set_index('연령대코드')
data19.sort_index()

       성별코드  시도코드  진료과목코드  주상병코드  부상병코드
연령대코드
1         1    41      13  H6691  J0191
1         1    47      13  H6640  J0180
1         1    47      13   J209  H6641
1         1    47      13  J0390  J0190
1         1    47      13  J0191   A090
...     ...   ...     ...    ...    ...
18        1    31       1  J4499  C3410
18        1    31       7   I109   E785
18        1    31       7   I109   R060
18        2    27       1  M5446   I509
18        2    46       4   M750  M1394

[13178345 rows x 5 columns]

In [11]:
agedata = data19.groupby(by = ['연령대코드', '주상병코드'])
agedata.size()

연령대코드  주상병코드
1      A044       2
       A047      49
       A048      15
       A049     363
       A069      17
               ...
18     Z9663     15
       Z9664      6
       Z9881      2
       Z9888    341
       Z_         6
Length: 79222, dtype: int64

In [15]:
age = agedata.size()
age.head()

연령대코드  주상병코드
1      A044       2
       A047      49
       A048      15
       A049     363
       A069      17
dtype: int64

In [16]:
age_df = pd.DataFrame(age)

## 원하는 컬럼으로 빈도수 확인하기

In [19]:
data_2019_df['주상병코드'].value_counts()

J209     1141433
I109      721046
F_        400125
E119      228032
N_        226973
          ...
P610           1
M8890          1
M2122          1
T864           1
M6137          1
Name: 주상병코드, Length: 9422, dtype: int64

In [20]:
data_2019_df['연령대코드'].value_counts()

13    1257824
12    1142160
14    1095067
15    1018216
1      975520
11     962494
16     937515
10     822247
2      674510
9      657625
8      650838
17     628376
7      493883
6      451349
5      361527
3      361001
4      344120
18     344073
Name: 연령대코드, dtype: int64

In [24]:
data_2019_01 = data_2019_df.groupby(by = ['연령대코드', '주상병코드'])
data_2019_01.size()

연령대코드  주상병코드
1      A044       2
       A047      49
       A048      15
       A049     363
       A069      17
               ...
18     Z9663     15
       Z9664      6
       Z9881      2
       Z9888    341
       Z_         6
Length: 79222, dtype: int64

In [25]:
data_2019_df.groupby(by = ['연령대코드'])['주상병코드'].size()

연령대코드
1      975520
2      674510
3      361001
4      344120
5      361527
6      451349
7      493883
8      650838
9      657625
10     822247
11     962494
12    1142160
13    1257824
14    1095067
15    1018216
16     937515
17     628376
18     344073
Name: 주상병코드, dtype: int64

In [31]:
data_1920 = pd.concat([data_2019_df, data_2020_df])
data_1920.head()

   성별코드  연령대코드  시도코드  진료과목코드  주상병코드  부상병코드
0     2     12    46       5   M751   M750
1     2     12    46       1  E1164   N308
2     2     12    46       1   N308  E1164
3     2     12    46       1  E1164   N308
4     2     12    46      13  H6531   J303

## 원하는 컬럼에서 원하는 연령대 뽑아보기

In [26]:
from collections import Counter

In [28]:
condition = data_df['연령대코드'] == 11
age_11 = data_df[condition]
age_11.head()

     성별코드  연령대코드  시도코드  진료과목코드  주상병코드
219     1     11    41       5   S336
220     1     11    41      13    J00
221     1     11    41      23  J0391
222     1     11    41       5  S7318
223     1     11    41       5   S637

In [29]:
from collections import Counter

age_11_total = Counter(age_11['주상병코드'])
age_11_total.most_common(30)

[('I109', 130126),
 ('J209', 67812),
 ('F_', 52255),
 ('N_', 51602),
 ('E119', 47820),
 ('K210', 24571),
 ('N185', 22571),
 ('M511', 22381),
 ('M750', 19390),
 ('L239', 18712),
 ('M5456', 18532),
 ('M771', 18139),
 ('M751', 17044),
 ('S3350', 16845),
 ('M501', 15253),
 ('J304', 14915),
 ('M170', 14845),
 ('M5422', 14767),
 ('K219', 14727),
 ('C_', 14022),
 ('J0390', 13772),
 ('B_', 13661),
 ('H0411', 13333),
 ('J029', 12743),
 ('J060', 12233),
 ('E785', 11052),
 ('J40', 10715),
 ('N300', 10622),
 ('B351', 10611),
 ('M4806', 10439)]

In [30]:
age_11_count = age_11_total.most_common(30)

In [31]:
age_11_df = pd.DataFrame(age_11_count, columns=['주상병코드', '빈도수'])

In [68]:
# age_11_df.to_excel('./data/aged_11.xlsx', index=False)

In [32]:
condition = data_df['연령대코드'] == 12
age_12 = data_df[condition]
age_12.head()

   성별코드  연령대코드  시도코드  진료과목코드  주상병코드
0     2     12    46       5   M751
1     2     12    46       1  E1164
2     2     12    46       1   N308
3     2     12    46       1  E1164
4     2     12    46      13  H6531

In [33]:
from collections import Counter

age_12_total = Counter(age_12['주상병코드'])
age_12_total.most_common(30)

[('I109', 189099),
 ('J209', 73525),
 ('E119', 66715),
 ('F_', 56418),
 ('N_', 37444),
 ('M170', 32599),
 ('N185', 31974),
 ('K210', 28056),
 ('M511', 27982),
 ('M5456', 22983),
 ('L239', 20955),
 ('M4806', 20602),
 ('M751', 20282),
 ('M750', 20215),
 ('S3350', 17384),
 ('K219', 17291),
 ('M501', 16325),
 ('E785', 15983),
 ('H0411', 15462),
 ('J304', 14637),
 ('M771', 14422),
 ('J0390', 14157),
 ('M171', 13929),
 ('C_', 13680),
 ('J029', 13464),
 ('M5422', 13459),
 ('J060', 12899),
 ('E118', 12867),
 ('B_', 12274),
 ('B351', 12203)]

In [34]:
age_12_count = age_12_total.most_common(30)

In [35]:
age_12_df = pd.DataFrame(age_12_count, columns=['주상병코드', '빈도수'])

In [48]:
# age_12_df.to_excel('./data/age_12.xlsx', index=False)

In [36]:
condition = data_df['연령대코드'] == 13
age_13 = data_df[condition]
age_13.head()

    성별코드  연령대코드  시도코드  진료과목코드  주상병코드
73     1     13    26       1    J40
74     1     13    26       4   E042
75     1     13    26      12  H0204
76     1     13    26       1    J40
77     1     13    26       1  K2531

In [37]:
age_13_total = Counter(age_13['주상병코드'])
age_13_total.most_common(30)

[('I109', 235201),
 ('E119', 77857),
 ('J209', 76631),
 ('F_', 62748),
 ('M170', 51882),
 ('M4806', 36599),
 ('N185', 34514),
 ('K210', 33447),
 ('M511', 31088),
 ('N_', 27082),
 ('M5456', 26544),
 ('M751', 22052),
 ('L239', 21436),
 ('M171', 20827),
 ('K219', 19521),
 ('M750', 19483),
 ('E785', 17902),
 ('N400', 17538),
 ('S3350', 17389),
 ('H0411', 16610),
 ('M501', 16400),
 ('E118', 15570),
 ('M179', 14791),
 ('J304', 13867),
 ('J40', 13626),
 ('J029', 12969),
 ('J0390', 12936),
 ('J060', 12623),
 ('C_', 12586),
 ('B351', 12308)]

In [38]:
age_13_count = age_13_total.most_common(30)

In [39]:
age_13_df = pd.DataFrame(age_13_count, columns=['주상병코드', '빈도수'])

In [53]:
# age_13_df.to_excel('./data/age_13.xlsx', index=False)

In [40]:
condition = data_df['연령대코드'] == 14
age_14 = data_df[condition]
age_14.head()

     성별코드  연령대코드  시도코드  진료과목코드 주상병코드
229     2     14    41       6  M511
230     2     14    41      14  R232
231     2     14    41      12  H103
232     2     14    41      14  R232
233     2     14    41      21  M502

In [41]:
age_14_total = Counter(age_14['주상병코드'])
age_14_total.most_common(30)

[('I109', 214517),
 ('E119', 67757),
 ('J209', 63102),
 ('M170', 60053),
 ('F_', 56135),
 ('M4806', 48061),
 ('N185', 36391),
 ('M5456', 28926),
 ('M511', 27860),
 ('K210', 26186),
 ('M171', 23201),
 ('N400', 20465),
 ('M751', 18302),
 ('L239', 18092),
 ('M750', 17095),
 ('K219', 16937),
 ('M179', 16624),
 ('H0411', 14592),
 ('S3350', 14207),
 ('N_', 13917),
 ('E118', 13709),
 ('E785', 13590),
 ('J40', 11955),
 ('M501', 11674),
 ('J304', 11115),
 ('J00', 10618),
 ('M5422', 10493),
 ('K297', 10346),
 ('J029', 10283),
 ('J060', 10207)]

In [42]:
age_14_count = age_14_total.most_common(30)

In [43]:
age_14_df = pd.DataFrame(age_14_count, columns=['주상병코드', '빈도수'])

In [62]:
age_14_df.to_excel('./data/age_14.xlsx', index=False)

# 지역별 병의원 데이터 전처리

In [44]:
# 데이터 호출
hos = pd.read_csv('./data/전국병원정보/fulldata_01_01_01_P_병원.csv', encoding='cp949')
hos.head()

,번호,개방서비스명,개방서비스아이디,개방자치단체코드,관리번호,인허가일자,인허가취소일자,영업상태구분코드,영업상태명,상세영업상태코드,...,지정취소일자,완화의료지정형태,완화의료담당부서명,구급차특수,구급차일반,총인원,구조사수,허가병상수,최초지정일자,Unnamed: 44
0,1,병원,01_01_01_P,5530000,PHMA220115530021021200002,20110221,NaN,2,휴업,02,...,NaN,NaN,NaN,0.0,0.0,NaN,NaN,0.0,NaN,NaN
1,2,병원,01_01_01_P,5710000,PHMA220185710109021200001,20180601,NaN,2,휴업,02,...,NaN,NaN,NaN,0.0,0.0,NaN,NaN,0.0,NaN,NaN
2,3,병원,01_01_01_P,4430000,PHMA220084430014021200003,20080414,NaN,2,휴업,02,...,NaN,NaN,NaN,0.0,0.0,NaN,NaN,0.0,NaN,NaN
3,4,병원,01_01_01_P,4470000,PHMA220164470017021200001,20160325,NaN,2,휴업,02,...,NaN,NaN,NaN,0.0,0.0,NaN,NaN,0.0,NaN,NaN
4,5,병원,01_01_01_P,5580000,PHMA220105580013021200001,20100507,NaN,2,휴업,02,...,NaN,NaN,NaN,0.0,0.0,NaN,NaN,0.0,NaN,NaN

In [45]:
# 실제 사용할 열만 선택하기
hos = hos[['영업상태명','도로명전체주소','사업장명','좌표정보(x)','좌표정보(y)','의료기관종별명','진료과목내용','진료과목내용명']]
hos.head()

,영업상태명,도로명전체주소,사업장명,좌표정보(x),좌표정보(y),의료기관종별명,진료과목내용,진료과목내용명
0,휴업,경기도 화성시 팔탄면 온천로 29,의료법인 화성의료재단 화성제일병원,187458.013247,402973.650082,병원,120 113 104,"외과, 이비인후과, 재활의학과"
1,휴업,충청북도 청주시 청원구 내수읍 마산길 8-11,의료법인홍익의료재단파스카요양병원,248074.000000,357472.000000,요양병원(일반요양병원),122,가정의학과
2,휴업,충청북도 옥천군 옥천읍 중앙로 72,의료법인건우의료재단큰사랑요양병원,251194.421742,311546.395897,요양병원(일반요양병원),122 104 120 115 301,"외과, 비뇨의학과, 재활의학과, 가정의학과, 한방내과"
3,휴업,충청북도 음성군 감곡면 장감로 118-1,의료법인 청미의료재단 청미요양병원,256423.100993,402026.479805,요양병원(일반요양병원),122 105 101,"내과, 정형외과, 가정의학과"
4,휴업,충청남도 계룡시 계룡대로 295 (금암동),의료법인 계룡의료재단 계룡병원,223019.435125,308022.966751,병원,101 122,"내과, 가정의학과"